Repository: collective/contentrules.slack
Catalog: src/contentrules/slack/locales/*/LC_MESSAGES/contentrules.slack.po
Languages: de, es, pt_br

source: Action to post a message to a Slack channel.
de: Aktion um eine Nachricht zu posten in einem Slack Kanal
es: Acción para enviar un mensaje a un canal de Slack
pt_br: Ação para postar uma mensagem em um canal do Slack.

source: Add Slack Action
de: Eine Slack Aktion hinzufügen
es: Añadir acción de Slack
pt_br: Adicionar ação de Slack

source: Channel
de: Kanal
es: Canal
pt_br: Canal

source: Channel to receive the message. eg.:"#plone-rulez"
de: Kanal um die Nachricht zu bekommen. eg.:"#plone-rulez"
es: Canal al que se enviará el mensaje. Por ejemplo: "#plone-rulez"
pt_br: Canal que receberá a mensagem. ex.: "#plone-rulez"

source: Color
de: Farbe
pt_br: Cor

source: Color of the message. Valid values are "good", "warning", "danger" or any hex color code (eg. #439FE0)
de: Farbe der Nachricht. Gültige Werte sind "good", "warning", "danger" oder andere hex farbcode (eg. #439FE0)
es: Color del mensaje. Las opciones válidas son "good", "warning", "danger" o cualquier código en hexadecimal (por ejemplo #439FE0)
pt_br: Cor da mensagem. Valores válidos são "good", "warning", "danger" ou qualquer cor descrita usando notação hexadecimal (ex.: #439FE0)

source: Configure element
de: Element Auslegen
es: Configurar elemento
pt_br: Configurar elemento

source: Edit Slack Action
de: Slack Aktion bearbeiten
es: Editar acción de Slack
pt_br: Editar ação de Slack

source: Fields
de: Felder
es: Campos
pt_br: Campos (Fields)

source: Fields are added to the bottom of the Slack message like a small table.Please add one definition per line in the format:"title|value|Short", i.e:"Review State|${review_state_title}|True"
de: Felder werden zu einer Slack Nachricht unten hingefügt wie eine kleine Tabelle. Bitte eine Definition pro Zeile hinfügen in diesem Format:"title|value|Short", i.e:"Review State|${review_state_title}|True"
es: Estos campos son añadidos al final del mensaje de Slack como una pequeña tabla. Por favor, añade una definición por línea siguiendo este formato: "título|valor|Corto", i.e:"Estado de la review|${review_state_title}|True"
pt_br: Fields são adicionados no rodapé da mensagem como uma pequena tabela.Por favor adicione uma definição por linha, no formato:"título|valor|curta", i.e:"Estado|${review_state_title}|True"

source: Icon
de: Symbol
es: Icono
pt_br: Ícone

source: Icon to be displayed on the message. eg:":flag-br:"
de: Ein Symbol auf die Nachricht darstellen. eg:":flag-de:"
es: Icono del mensaje. Por ejemplo:":flag-br:"
pt_br: Ícone para ser exibido na mensagem. ex:":flag-br:"

source: Link to be added to the title. i.e.: "${absolute_url}"
de: Ein Link zu einem Titel hinfügen. i.e.: "${absolute_url}"
es: Enlace del título del mensaje. Por ejemplo: "${absolute_url}"
pt_br: Link a ser adicionado ao título. ex: "${absolute_url}"

source: Name to be displayed as the author of this message.
de: Diesen Name darstellen als der Autor der Nachricht.
es: Nombre del autor del mensaje.
pt_br: Nome que será exibido como autor desta mensagem.

source: Post a message on channel ${channel}
de: Eine Nachricht in einem Kanal posten ${channel}
es: Enviar un mensaje en el canal ${channel}
pt_br: Postar uma mensagem no canal ${channel}

source: Post a message to Slack
de: Eine Nachricht auf Slack posten
es: Enviar un mensaje a Slack
pt_br: Enviar mensagem para o Slack

source: Pretext
de: Vorwand
es: Texto antes del mensaje
pt_br: Chamada

source: Send a message to Slack
de: Eine Nachricht an Slack senden
es: Enviar mensaje a Slack
pt_br: Enviar mensagem para o Slack

source: Text
es: Texto
pt_br: Texto

source: The title is displayed as larger, bold text near the top of a message attachment.
de: Der Titel wird als ein großer, fett gedruckter Text neben dem Anfang der Nachricht gezeigt.
es: El título se muestra como texto grande y en negrita en la parte de arriba del mensaje.
pt_br: O título é exibido em negrito, e com uma fonte maior, próximo ao topo da mensagem.

source: This is optional text that appears above the message attachment block.
de: Das ist ein optionaler Text, der ober dem Nachricht-Anhang-Block gezeigt wird.
es: Este es un texto opcional que aparece encima del mensaje.
pt_br: Este é um texto opcional que aparece acima do bloco de anexos da mensagem.

source: This is the main text in a message attachment.
de: Das ist der haupte Text eines Nachricht-Anhangs
es: Este es el texto principal del mensaje.
pt_br: Este é o texto principal do anexo da mensagem.

source: Title
de: Titel
es: Título
pt_br: Título

source: Title Link
de: Titel-Link
es: Enlace del título
pt_br: Link do Título

source: URL configuration for this integration. i.e.:"https://hooks.slack.com/services/T00000000/B00000000/YYYYYYYYYYYYYYYYYYYYYYYY"
de: URL Konfiguration für diese Integration. i.e.:"https://hooks.slack.com/services/T00000000/B00000000/YYYYYYYYYYYYYYYYYYYYYYYY"
es: Configuración de la URL para esta integración. Por ejemplo:"https://hooks.slack.com/services/T00000000/B00000000/YYYYYYYYYYYYYYYYYYYYYYYY"
pt_br: URL desta integração. ex:"https://hooks.slack.com/services/T00000000/B00000000/YYYYYYYYYYYYYYYYYYYYYYYY"

source: Username
de: Nutzername
es: Nombre de usuario
pt_br: Nome de usuário

source: Webhook url
es: URL del webhook
pt_br: URL do webhook

source: category-contentrules-slacksub
de: Kategorie
es: Categoría
pt_br: Categoria

source: description-contentrules-slacksub
de: Inhalte in diesem Kanal, Vorwand, Titel, Text und Felder können mit "$&#123;&#125;" Variablen von der Tabelle, die unten in diesem Form ist, ersetzt werden.
es: Los contenidos del canal, texto antes del mensaje, título, texto y los campos podría ser reemplazado por variables "$&#123;&#125;" de la tabla debajo de este formulario.
pt_br: Os conteúdos de canal, chamada, título, texto e campos podem ser substituídos com variáveis "$&#123;&#125;" da tabela existem no rodapé deste formulário.

source: slack-api-webhook
de: Webhooks API Dokumentation
es: Documentación de los Webhooks de la API
pt_br: Documentação da API de webhooks (em inglês)

source: slack-configuration
de: Slack Konfiguration
es: Configuración de Slack
pt_br: Configuração do Slack

source: slack-create-webhook
de: Ein neues Webhook erstellen
es: Crear un nuevo webhook
pt_br: criar um novo webhook

source: slack-documentation
de: Um besser zu verstehen, was mit dieser Inhalt-Regel gemacht werden kann, empfehlen wir die folgende Dokumentation zu lesen.
es: Para entender mejor que se puede hacer con esta regla de contenido, recomendamos la lectura de la siguiente documentación.
pt_br: Para melhor entender o que pode ser feito com esta regra de conteúdo, recomendamos a leitura da seguinte documentação

source: slack-intro-webhook
de: Nicht vergessen
es: No te olvides de
pt_br: Não se esqueça de

source: slack-message-builder
de: Nachricht ersteller
es: Constructor de mensajes
pt_br: Construtor de mensagens (Message builder)

source: substitution-contentrules-slacksub
de: Einsetzung
es: Sustitución
pt_br: Substituição

source: title_contentrules_slacksub
de: Einsetzungen
es: Sustituciones
pt_br: Substituições

source: variable-contentrules-slacksub
de: Variable
es: Variable
pt_br: Variável
